RIET/src/Reports/ФормированиеСтоимостиУЕ/ФормированиеСтоимостиУЕ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ФормированиеСтоимостиУЕ</name>
  <comment>Расчет-справка &quot;Формирование стоимости при расчете в условных единицах&quot;</comment>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
</mdclass:Report>

RIET/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

RIET/src/Enums/РасчетыВозврат/РасчетыВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РасчетыВозврат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Расчеты</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

RIET/src/ChartsOfCharacteristicTypes/ВидыСубконтоХозрасчетные/ВидыСубконтоХозрасчетные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконтоХозрасчетные</name>
  <comment>(Регл)</comment>
  <type>
    <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
    <types>CatalogRef.Склады</types>
    <types>DocumentRef.ПередачаОС</types>
    <types>DocumentRef.АвансовыйОтчет</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>DocumentRef.СчетФактураВыданный</types>
    <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
    <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
    <types>DocumentRef.ПринятиеКУчетуОС</types>
    <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>DocumentRef.РасходныйКассовыйОрдер</types>
    <types>EnumRef.ВидыПлатежейВГосБюджет</types>
    <types>CatalogRef.НомераГТД</types>
    <types>EnumRef.ДвиженияЦелевыхСредств</types>
    <types>CatalogRef.КлассификаторСтранМира</types>
    <types>CatalogRef.ПрочиеДоходыИРасходы</types>
    <types>EnumRef.ВидыСтоимости</types>
    <types>DocumentRef.КорректировкаДолга</types>
    <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
    <types>CatalogRef.БанковскиеСчета</types>
    <types>EnumRef.УсловияПоступленияИВыбытияИмущества</types>
    <types>CatalogRef.ПодразделенияОрганизаций</types>
    <types>DocumentRef.СчетФактураПолученный</types>
    <types>CatalogRef.НоменклатурныеГруппы</types>
    <types>EnumRef.УровниБюджетов</types>
    <types>CatalogRef.ОбъектыСтроительства</types>
    <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.РасходыБудущихПериодов</types>
    <types>DocumentRef.РеализацияТоваровУслуг</types>
    <types>EnumRef.ВидыНачисленийОплатыТрудаПоСт255НК</types>
    <types>DocumentRef.ОтражениеНачисленияНДС</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.Организации</types>
    <types>EnumRef.СтавкиНДС</types>
    <types>EnumRef.ВидыЦенностей</types>
    <types>CatalogRef.Номенклатура</types>
    <types>EnumRef.ПрибылиИУбытки</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>EnumRef.ВидыАктивовИОбязательств</types>
    <types>CatalogRef.ФизическиеЛица</types>
  </type>
  <predefined>
    <items>
      <name>БанковскиеСчета</name>
      <description>Банковские счета</description>
      <code>00008</code>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </items>
    <items>
      <name>ВидНачисленийОплатыТрудаПоСтатье255НК</name>
      <description>Вид начислений оплаты труда</description>
      <code>00031</code>
      <type>
        <types>EnumRef.ВидыНачисленийОплатыТрудаПоСт255НК</types>
      </type>
    </items>
    <items>
      <name>ВидыАктивовИОбязательств</name>
      <description>Виды активов и обязательств</description>
      <code>00023</code>
      <type>
        <types>EnumRef.ВидыАктивовИОбязательств</types>
      </type>
    </items>
    <items>
      <name>ВидыПлатежейВГосБюджет</name>
      <description>Виды платежей в бюджет (фонды)</description>
      <code>00022</code>
      <type>
        <types>EnumRef.ВидыПлатежейВГосБюджет</types>
      </type>
    </items>
    <items>
      <name>ВидыСтоимости</name>
      <description>Виды стоимости</description>
      <code>00049</code>
      <type>
        <types>EnumRef.ВидыСтоимости</types>
      </type>
    </items>
    <items>
      <name>ВидыЦенностей</name>
      <description>Виды ценностей</description>
      <code>00043</code>
      <type>
        <types>EnumRef.ВидыЦенностей</types>
      </type>
    </items>
    <items>
      <name>ДвиженияЦелевыхСредств</name>
      <description>Движения целевых средств</description>
      <code>00030</code>
      <type>
        <types>EnumRef.ДвиженияЦелевыхСредств</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>00016</code>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </items>
    <items>
      <name>ДокументыРасчетовСКонтрагентами</name>
      <description>Документы расчетов с контрагентом</description>
      <code>00039</code>
      <type>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтражениеНачисленияНДС</types>
      </type>
    </items>
    <items>
      <name>ДокументыРеализации</name>
      <description>Документы реализации</description>
      <code>00046</code>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтражениеНачисленияНДС</types>
      </type>
    </items>
    <items>
      <name>Комиссионеры</name>
      <description>Комиссионеры</description>
      <code>00037</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>00005</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>00001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>НоменклатурныеГруппы</name>
      <description>Номенклатурные группы</description>
      <code>00012</code>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </items>
    <items>
      <name>НомераГТД</name>
      <description>Номера ГТД</description>
      <code>00050</code>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </items>
    <items>
      <name>ОбособленныеПодразделения</name>
      <description>Обособленные подразделения</description>
      <code>00036</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ОбъектыСтроительства</name>
      <description>Объекты строительства</description>
      <code>00011</code>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>ОсновныеСредства</name>
      <description>Основные средства</description>
      <code>00004</code>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </items>
    <items>
      <name>Партии</name>
      <description>Партии</description>
      <code>00038</code>
      <type>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
      </type>
    </items>
    <items>
      <name>Подразделения</name>
      <description>Подразделения</description>
      <code>00015</code>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>00014</code>
      <type>
        <types>EnumRef.ПрибылиИУбытки</types>
      </type>
    </items>
    <items>
      <name>Продавцы</name>
      <description>Продавцы</description>
      <code>00040</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>00013</code>
      <type>
        <types>CatalogRef.ПрочиеДоходыИРасходы</types>
      </type>
    </items>
    <items>
      <name>РаботникиОрганизаций</name>
      <description>Работники организаций</description>
      <code>00003</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>00017</code>
      <type>
        <types>CatalogRef.РасходыБудущихПериодов</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>00027</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>СпособыСтроительства</name>
      <description>Способы строительства</description>
      <code>00034</code>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </items>
    <items>
      <name>СтавкиНДС</name>
      <description>Ставки НДС</description>
      <code>00026</code>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </items>
    <items>
      <name>СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
      <code>00021</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>СтатьиЗатрат</name>
      <description>Статьи затрат</description>
      <code>00007</code>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </items>
    <items>
      <name>СтраныПроисхождения</name>
      <description>Страны происхождения</description>
      <code>00051</code>
      <type>
        <types>CatalogRef.КлассификаторСтранМира</types>
      </type>
    </items>
    <items>
      <name>СФВыданные</name>
      <description>Счета-фактуры выданные</description>
      <code>00052</code>
      <type>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.СчетФактураВыданный</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтражениеНачисленияНДС</types>
      </type>
    </items>
    <items>
      <name>СФПолученные</name>
      <description>Счета-фактуры полученные</description>
      <code>00042</code>
      <type>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.СчетФактураПолученный</types>
      </type>
    </items>
    <items>
      <name>УровниБюджетов</name>
      <description>Уровни бюджетов</description>
      <code>00025</code>
      <type>
        <types>EnumRef.УровниБюджетов</types>
      </type>
    </items>
    <items>
      <name>УсловияПоступленияИВыбытия</name>
      <description>Условия поступления и выбытия</description>
      <code>00020</code>
      <type>
        <types>EnumRef.УсловияПоступленияИВыбытияИмущества</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

RIET/src/Reports/ФормированиеСтоимостиУЕ/ObjectModule.bsl
#Если КЛИЕНТ Тогда
	
// процедура формирует и выводит отчет по движениям документа
Процедура СформироватьИВывестиОтчет() Экспорт
	
	ДокументДляВывода = Новый ТабличныйДокумент;
	ВозможностьПостроения = СформироватьОтчет(ДокументДляВывода);
	Если ВозможностьПостроения Тогда
		ДокументДляВывода.Показать("Расчет-справка «Формирование стоимости при расчете в условные единицах» для документа "+ Строка(Документ));
	КонецЕсли;	
	
КонецПроцедуры
	
	
Функция СформироватьОтчет(РезультирующийДокумент) Экспорт

	Если Документ.Пустая() Тогда
		Предупреждение("Запишите и проведите документ, по которому формируется отчет");
		Возврат Ложь;
	ИначеЕсли не Документ.Проведен тогда
		Предупреждение("Проведите документ, по которому формируется отчет");
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(Документ);
	
	//Определение необходимых параметров документа
	
	ПараметрыДокумента = Новый структура ("ВидДокумента,ВидОперации,
	|СчетУчетаРасчетовСКонтрагентом, СчетУчетаРасчетовПоАвансам,
	|ВалютаВзаиморасчетов,КурсВзаиморасчетов,КратностьВзаиморасчетов,РасчетыВУсловныхЕдиницах,
	|ВалютаДокумента,КурсДокумента,КратностьДокумента, СуммаДокумента");
	
	СтрокаСообщения = "";
	Для каждого Параметр Из ПараметрыДокумента Цикл
	    Значение = Неопределено;
		СтруктураШапкиДокумента.Свойство(Параметр.Ключ,Значение);
		Если не ОбщегоНазначения.ЗначениеНеЗаполнено(Значение) Тогда
			ПараметрыДокумента.Вставить(Параметр.Ключ,Значение);
		ИначеЕсли Параметр.Ключ = "СчетУчетаРасчетовСКонтрагентом" Тогда
			СтрокаСообщения = ?(ПустаяСтрока(СтрокаСообщения),"",Символы.ПС)+ " - не определен счет учета расчетов по документу";
		ИначеЕсли Параметр.Ключ = "СуммаДокумента" Тогда
			СтрокаСообщения = ?(ПустаяСтрока(СтрокаСообщения),"",Символы.ПС)+ " - не определена сумма (расчетов) по документу";
		ИначеЕсли Параметр.Ключ = "РасчетыВУсловныхЕдиницах" Тогда
			СтрокаСообщения = ?(ПустаяСтрока(СтрокаСообщения),"",Символы.ПС)+ " - не используются расчеты в условных единицах";
			ПараметрыДокумента.Вставить(Параметр.Ключ,Ложь);
		ИначеЕсли Параметр.Ключ = "ВалютаДокумента"
			или Параметр.Ключ = "ВалютаВзаиморасчетов" тогда
			ПараметрыДокумента.Вставить(Параметр.Ключ,СтруктураШапкиДокумента.ВалютаРегламентированногоУчета);
		ИначеЕсли Параметр.Ключ = "КурсДокумента" 
			или Параметр.Ключ = "КратностьДокумента"
			или Параметр.Ключ = "КурсВзаиморасчетов"
			или Параметр.Ключ = "КратностьВзаиморасчетов"
			Тогда
			ПараметрыДокумента.Вставить(Параметр.Ключ,1);
		КонецЕсли; 
	КонецЦикла; 
	
	Если не ПустаяСтрока(СтрокаСообщения) Тогда
		//Ошибки при определении параметров
		Предупреждение("В документе, по которому формируется отчет:"+Символы.ПС+СтрокаСообщения+Символы.ПС+
		"Расчет-справка «Формирование стоимости при расчете в условные единицах» не сформирована.");
		Возврат Ложь;
	КонецЕсли; 
	
	Если ОбщегоНазначения.ЗначениеНеЗаполнено(ПараметрыДокумента.СчетУчетаРасчетовПоАвансам) Тогда
		ПараметрыДокумента.Вставить("СчетУчетаРасчетовПоАвансам",ПараметрыДокумента.СчетУчетаРасчетовСКонтрагентом);
	КонецЕсли;
	
	Если не ПараметрыДокумента.РасчетыВУсловныхЕдиницах Тогда
		Предупреждение("В документе, по которому формируется отчет, не используются расчеты в условных единицах.");
		Возврат Ложь;
	КонецЕсли; 
	
	ПараметрыДвиженийДокумента = УправлениеВзаиморасчетами.ОпределениеНаправленияДвиженияДляДокументаПриобретенияРеализации(ПараметрыДокумента.ВидДокумента,ПараметрыДокумента.ВидОперации);
	НаправлениеДвижения = ПараметрыДвиженийДокумента.Направление;
	ЭтоВозврат          = (ПараметрыДвиженийДокумента.РасчетыВозврат = Перечисления.РасчетыВозврат.Возврат);
	Множитель = ?(НаправлениеДвижения = "Выбытие",-1,1);
	
	Если не (НаправлениеДвижения = "Поступление" или НаправлениеДвижения = "Выбытие") Тогда
		Предупреждение("Документ, по которому формируется отчет, не отражает операции приобретения или реализации.");
		Возврат Ложь;
	ИначеЕсли ЭтоВозврат тогда
		Предупреждение("Документ, по которому формируется отчет, отражает возвраты.
		|При возврате зачет авансов не производится и сумма документа не пересчитывается.");
		Возврат Ложь;
	КонецЕсли; 
	
	

	// Определяем погашенные авансы по оборотам
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.КорСчет,
	|	ХозрасчетныйОбороты.КорСубконто1,
	|	ХозрасчетныйОбороты.КорСубконто2,
	|	ХозрасчетныйОбороты.КорСубконто3,
	|	ХозрасчетныйОбороты.Валюта,
	|	СУММА(ХозрасчетныйОбороты.СуммаОборот) * &Знак КАК СуммаОборот,
	|	СУММА(ХозрасчетныйОбороты.ВалютнаяСуммаОборот) * &Знак КАК ВалютнаяСуммаОборот
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(, , Регистратор, Счет = &СчетРасчетов, &ВидыСубконто, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|ГДЕ
	|	ХозрасчетныйОбороты.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОбороты.КорСчет,
	|	ХозрасчетныйОбороты.КорСубконто1,
	|	ХозрасчетныйОбороты.КорСубконто2,
	|	ХозрасчетныйОбороты.КорСубконто3,
	|	ХозрасчетныйОбороты.Валюта";
	
	Запрос.УстановитьПараметр("Регистратор",СтруктураШапкиДокумента.Ссылка);
	Запрос.УстановитьПараметр("Организация",СтруктураШапкиДокумента.Организация);
	
	ВидыСубконто = Новый Массив();
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	Запрос.УстановитьПараметр("ВидыСубконто",ВидыСубконто);
	Запрос.УстановитьПараметр("СчетРасчетов",ПараметрыДокумента.СчетУчетаРасчетовСКонтрагентом);
	Запрос.УстановитьПараметр("Знак",Множитель);
	//Запрос.УстановитьПараметр("СчетАвансов", ПараметрыДокумента.СчетАвансов);
	
	Результат = Запрос.Выполнить();
	ДвиженияУЕ = Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	СуммаДокументаУЕ = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(ПараметрыДокумента.СуммаДокумента
		,ПараметрыДокумента.ВалютаДокумента,ПараметрыДокумента.ВалютаВзаиморасчетов
		,ПараметрыДокумента.КурсДокумента, ПараметрыДокумента.КурсВзаиморасчетов
		,ПараметрыДокумента.КратностьДокумента, ПараметрыДокумента.КратностьВзаиморасчетов);
	
	ТаблицаРасчетов = Новый ТаблицаЗначений();
	ТаблицаРасчетов.Колонки.Добавить("Документ");
	ТаблицаРасчетов.Колонки.Добавить("ДатаДокумента",ОбщегоНазначения.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаРасчетов.Колонки.Добавить("КурсДокумента",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,4));
	ТаблицаРасчетов.Колонки.Добавить("Сумма",		ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаРасчетов.Колонки.Добавить("СуммаВал",	ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15,2));
	ТаблицаРасчетов.Колонки.Добавить("ЭтоАванс",	Новый ОписаниеТипов("Булево"));
	
	СтрокиЗачетаАванса = ДвиженияУЕ.НайтиСтроки(Новый Структура("КорСчет",ПараметрыДокумента.СчетУчетаРасчетовПоАвансам));
	Если Не СтрокиЗачетаАванса.Количество() =0 Тогда
		СубконтоДокументаРасчетов = ПараметрыДокумента.СчетУчетаРасчетовПоАвансам.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами,"ВидСубконто");
		Если СубконтоДокументаРасчетов = Неопределено Тогда
			// Субконто документов расчетов на корр счете не онаружено.
			// Невозможно определить документ, по которому зачтен аванс и дату, а так же курс документа.
		Иначе
			СубконтоДокументаРасчетов = СубконтоДокументаРасчетов.НомерСтроки;
		КонецЕсли;
				
		МетаданныеДокументовАванса = Новый Соответствие();
		
		//Заполнение таблицы значениями зачитываемых авансов.
		Для каждого СтрокаАванса Из СтрокиЗачетаАванса Цикл
			ДокументАванса = Неопределено;
			Если не ОбщегоНазначения.ЗначениеНеЗаполнено(СубконтоДокументаРасчетов) Тогда
				ДокументАванса = СтрокаАванса["КорСубконто"+СубконтоДокументаРасчетов];
			КонецЕсли;
			
			СтрокаРасчетов = ТаблицаРасчетов.Добавить();
			СтрокаРасчетов.ЭтоАванс	= Истина;
			СтрокаРасчетов.Сумма	= СтрокаАванса.СуммаОборот;
			СтрокаРасчетов.СуммаВал = СтрокаАванса.ВалютнаяСуммаОборот;
			
			Если ОбщегоНазначения.ЗначениеНеЗаполнено(ДокументАванса) тогда
				КурсДокументаАванса = Неопределено;
			Иначе
				СтрокаРасчетов.Документ	= ДокументАванса;
				СтрокаРасчетов.ДатаДокумента = ДокументАванса.Дата;
				
				Если МетаданныеДокументовАванса.Получить(ТипЗнч(ДокументАванса)) = неопределено Тогда
					МетаданныеДокументовАванса.Вставить(ТипЗнч(ДокументАванса),ДокументАванса.Метаданные());
				КонецЕсли; 
				
				КурсДокументаАванса = МетаданныеДокументовАванса.Получить(ТипЗнч(ДокументАванса)).реквизиты.Найти("КурсВзаиморасчетов");
				Если не КурсДокументаАванса = Неопределено тогда
					КурсДокументаАванса = ДокументАванса.КурсВзаиморасчетов;
				КонецЕсли;
			КонецЕсли;
			
			Если КурсДокументаАванса = Неопределено Тогда
				КурсДокументаАванса = Окр(?(СтрокаРасчетов.СуммаВал=0,0,СтрокаРасчетов.Сумма/СтрокаРасчетов.СуммаВал),4);
			КонецЕсли;
			
			СтрокаРасчетов.КурсДокумента = КурсДокументаАванса;
		КонецЦикла; 
	КонецЕсли; 
	
	ОбнаруженАванс = (ТаблицаРасчетов.Количество()>0);
	Если ОбнаруженАванс Тогда
		ТаблицаРасчетов.Свернуть("Документ,ДатаДокумента,КурсДокумента, ЭтоАванс","Сумма,СуммаВал");
		ТаблицаРасчетов.Сортировать("ЭтоАванс убыв, ДатаДокумента возр,Документ возр");
	КонецЕсли; 
	
	НеоплаченнаяСуммаУЕ = СуммаДокументаУЕ - ТаблицаРасчетов.итог("СуммаВал");
	
	Если НеоплаченнаяСуммаУЕ<>0 Тогда
	    //Определим рублевый эквивалент неоплаченной суммы
		Если ПараметрыДокумента.ВалютаДокумента = ПараметрыДокумента.ВалютаВзаиморасчетов Тогда
		    //Документ выписан в валюте. Рублевый остаток определяем по курсу расчетов
			НеоплаченнаяСумма = ОбщегоНазначения.ПересчитатьИзВалютыВВалюту(НеоплаченнаяСуммаУЕ
			,ПараметрыДокумента.ВалютаВзаиморасчетов,СтруктураШапкиДокумента.ВалютаРегламентированногоУчета
			,ПараметрыДокумента.КурсВзаиморасчетов,1
			,ПараметрыДокумента.КратностьВзаиморасчетов,1);
        Иначе
			НеоплаченнаяСумма = Окр(ПараметрыДокумента.СуммаДокумента * НеоплаченнаяСуммаУЕ/СуммаДокументаУЕ);
		КонецЕсли;
	Иначе
		НеоплаченнаяСумма = 0;
	КонецЕсли; 
	
	РезультирующийДокумент.Очистить();
	Макет = ПолучитьМакет("РасчетКурса");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ПредставлениеДокумента	= Строка(СтруктураШапкиДокумента.Ссылка);
	ОбластьЗаголовок.Параметры.Документ 				= СтруктураШапкиДокумента.Ссылка;
	ОбластьЗаголовок.Параметры.СуммаДокументаУЕ			= СуммаДокументаУЕ;
	ОбластьЗаголовок.Параметры.Валюта					= Строка(ПараметрыДокумента.ВалютаВзаиморасчетов);
	ОбластьЗаголовок.Параметры.КурсДокумента			= ПараметрыДокумента.КурсВзаиморасчетов;
	РезультирующийДокумент.Вывести(ОбластьЗаголовок);
	
	Если ОбнаруженАванс тогда
		РезультирующийДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
		НомерСтроки=0;
		Для Каждого Аванс из ТаблицаРасчетов цикл
			НомерСтроки=НомерСтроки+1;
           	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки; 
			ОбластьСтрока.Параметры.ДатаДок = Аванс.ДатаДокумента;
			ОбластьСтрока.Параметры.ДокументАванса = Аванс.Документ;
			ОбластьСтрока.Параметры.ДокументАвансаСтрока = Строка(Аванс.Документ);
			ОбластьСтрока.Параметры.СуммаУЕ = Аванс.СуммаВал;
			ОбластьСтрока.Параметры.Сумма = Аванс.Сумма;
			ОбластьСтрока.Параметры.КурсДокумента = Аванс.КурсДокумента;
			РезультирующийДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
	   	ОбластьИтогов = Макет.ПолучитьОбласть("ИтогоАвансов");
		ОбластьИтогов.Параметры.ВсегоУЕ = ТаблицаРасчетов.Итог("СуммаВал");
		ОбластьИтогов.Параметры.Всего = ТаблицаРасчетов.Итог("Сумма");
		РезультирующийДокумент.Вывести(ОбластьИтогов);
	Иначе
		РезультирующийДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаБезАвансов"));
	КонецЕсли;
	
	ОбластьСтрока = Макет.ПолучитьОбласть("ИтоговаяСумма");
	ОбластьСтрока.Параметры.СуммаУЕ =	НеоплаченнаяСуммаУЕ;
	ОбластьСтрока.Параметры.Сумма   = 	НеоплаченнаяСумма;
	ОбластьСтрока.Параметры.ИтогоУЕ =   СуммаДокументаУЕ;
	ОбластьСтрока.Параметры.ИтогоСумма =НеоплаченнаяСумма + ТаблицаРасчетов.Итог("Сумма");
	ОбластьСтрока.Параметры.КурсДокумента =  ПараметрыДокумента.КурсВзаиморасчетов;
	РезультирующийДокумент.Вывести(ОбластьСтрока);
	
	Если ОбнаруженАванс тогда
		КурсРасчетный=?(СуммаДокументаУЕ = 0,0, (ТаблицаРасчетов.Итог("Сумма")+НеоплаченнаяСумма)/(СуммаДокументаУЕ));
		РасчетКурса = "( " + ТаблицаРасчетов.Итог("Сумма")+" + " +НеоплаченнаяСумма+" ) / ( " + ТаблицаРасчетов.Итог("СуммаВал")+" + " +НеоплаченнаяСуммаУЕ+" ) = "+Формат(КурсРасчетный,"ЧЦ=8; ЧДЦ=4; ЧН=Отсутствует");
		ОбластьРасчет = Макет.ПолучитьОбласть("Расчет");
		ОбластьРасчет.Параметры.РасчетКурса  = РасчетКурса;
		РезультирующийДокумент.Вывести(ОбластьРасчет);
	КонецЕсли;
	
	РезультирующийДокумент.Вывести(Макет.ПолучитьОбласть("Подписи"));

	
	РезультирующийДокумент.ОтображатьЗаголовки = ложь;
	РезультирующийДокумент.ОтображатьСетку = ложь;
	РезультирующийДокумент.ТолькоПросмотр = истина;
	РезультирующийДокумент.Автомасштаб = Истина;
	Состояние("");

	Возврат Истина;
	
КонецФункции
#КонецЕсли
